update readme for mermaid
